#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
```
Success! The configuration is valid.



```
#### Terraform Plan 📖`pending changes!`

<details><summary>Show Plan</summary>

```
module.vault-deploy.tls_private_key.vault-cforigin-tls: Refreshing state... [id=3ffb6e83250313efc8c804112080e068044f53df]
module.vault-deploy.tls_cert_request.vault-cforigin-tls: Refreshing state... [id=073d01660f5f388b1717b4ef2c40f51c159e3c5a]
module.vault-deploy.google_service_account.vault: Refreshing state... [id=projects/jtcressy-net-235001/serviceAccounts/vault-sa@jtcressy-net-235001.iam.gserviceaccount.com]
module.vault-deploy.google_secret_manager_secret.vault-tls-cert: Refreshing state... [id=projects/jtcressy-net-235001/secrets/vault-tls-cert]
module.vault-deploy.google_kms_key_ring.vault-production: Refreshing state... [id=projects/jtcressy-net-235001/locations/global/keyRings/vault-production]
module.vault-deploy.google_secret_manager_secret.vault-tls-key: Refreshing state... [id=projects/jtcressy-net-235001/secrets/vault-tls-key]
module.vault-deploy.google_storage_bucket.vault: Refreshing state... [id=vault-jtcressy-net]
module.vault-deploy.google_secret_manager_secret_version.vault-tls-key: Refreshing state... [id=projects/313081364289/secrets/vault-tls-key/versions/1]
module.vault-deploy.google_secret_manager_secret_iam_member.vault-tls-cert: Refreshing state... [id=projects/jtcressy-net-235001/secrets/vault-tls-cert/roles/secretmanager.secretAccessor/serviceAccount:vault-sa@jtcressy-net-235001.iam.gserviceaccount.com]
module.vault-deploy.google_secret_manager_secret_iam_member.vault-tls-key: Refreshing state... [id=projects/jtcressy-net-235001/secrets/vault-tls-key/roles/secretmanager.secretAccessor/serviceAccount:vault-sa@jtcressy-net-235001.iam.gserviceaccount.com]
module.vault-deploy.cloudflare_origin_ca_certificate.vault-cforigin-tls: Refreshing state... [id=54763968084081232118418281326759118340553908914]
module.vault-deploy.google_secret_manager_secret_version.vault-tls-cert: Refreshing state... [id=projects/313081364289/secrets/vault-tls-cert/versions/1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.vault-deploy.cloudflare_record.jtcressy-net will be created
  + resource "cloudflare_record" "jtcressy-net" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "vault"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = "d6a66b1078c5ff2e318fb5b88f961136"
    }

  # module.vault-deploy.google_cloud_run_domain_mapping.vault will be created
  + resource "google_cloud_run_domain_mapping" "vault" {
      + id       = (known after apply)
      + location = "us-central1"
      + name     = "vault.jtcressy.net"
      + project  = (known after apply)
      + status   = (known after apply)

      + metadata {
          + annotations      = (known after apply)
          + generation       = (known after apply)
          + labels           = (known after apply)
          + namespace        = "jtcressy-net-235001"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + certificate_mode = "AUTOMATIC"
          + route_name       = "vault"
        }
    }

  # module.vault-deploy.google_cloud_run_service.vault will be created
  + resource "google_cloud_run_service" "vault" {
      + autogenerate_revision_name = true
      + id                         = (known after apply)
      + location                   = "us-central1"
      + name                       = "vault"
      + project                    = (known after apply)
      + status                     = (known after apply)

      + metadata {
          + annotations      = (known after apply)
          + generation       = (known after apply)
          + labels           = (known after apply)
          + namespace        = "jtcressy-net-235001"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + template {
          + metadata {
              + annotations      = {
                  + "autoscaling.knative.dev/maxScale" = "1"
                  + "run.googleapis.com/sandbox"       = "gvisor"
                }
              + generation       = (known after apply)
              + name             = (known after apply)
              + namespace        = (known after apply)
              + resource_version = (known after apply)
              + self_link        = (known after apply)
              + uid              = (known after apply)
            }

          + spec {
              + container_concurrency = 80
              + service_account_name  = "vault-sa@jtcressy-net-235001.iam.gserviceaccount.com"
              + serving_state         = (known after apply)
              + timeout_seconds       = (known after apply)

              + containers {
                  + args    = [
                      + "server",
                    ]
                  + command = [
                      + "/usr/local/bin/docker-entrypoint.sh",
                    ]
                  + image   = "us.gcr.io/jtcressy-net-235001/vault:1.10.2"

                  + env {
                      + name  = "SKIP_SETCAP"
                      + value = "true"
                    }
                  + env {
                      + name  = "VAULT_API_ADDR"
                      + value = "https://vault.jtcressy.net"
                    }
                  + env {
                      + name  = "VAULT_LOCAL_CONFIG"
                      + value = jsonencode(
                            {
                              + default_lease_ttl = "168h"
                              + disable_mlock     = true
                              + listener          = {
                                  + tcp = {
                                      + address         = "0.0.0.0:8080"
                                      + tls_cert_file   = "/tls-cert/tls.crt"
                                      + tls_disable     = 0
                                      + tls_key_file    = "/tls-key/tls.key"
                                      + tls_min_version = "tls13"
                                    }
                                }
                              + log_format        = "json"
                              + log_level         = "ERROR"
                              + max_lease_ttl     = "720h"
                              + seal              = {
                                  + gcpckms = {
                                      + crypto_key = "vault-key"
                                      + key_ring   = "vault-production"
                                      + project    = "jtcressy-net-235001"
                                      + region     = "global"
                                    }
                                }
                              + storage           = {
                                  + gcs = {
                                      + bucket = "vault-jtcressy-net"
                                    }
                                }
                              + ui                = true
                            }
                        )
                    }

                  + ports {
                      + container_port = (known after apply)
                      + name           = (known after apply)
                      + protocol       = (known after apply)
                    }

                  + resources {
                      + limits = {
                          + "cpu"    = "1000m"
                          + "memory" = "256Mi"
                        }
                    }

                  + volume_mounts {
                      + mount_path = "/tls-cert"
                      + name       = "tls-cert"
                    }
                  + volume_mounts {
                      + mount_path = "/tls-key"
                      + name       = "tls-key"
                    }
                }

              + volumes {
                  + name = "tls-cert"

                  + secret {
                      + default_mode = 292
                      + secret_name  = "vault-tls-cert"

                      + items {
                          + key  = "latest"
                          + mode = 256
                          + path = "tls.crt"
                        }
                    }
                }
              + volumes {
                  + name = "tls-key"

                  + secret {
                      + default_mode = 292
                      + secret_name  = "vault-tls-key"

                      + items {
                          + key  = "latest"
                          + mode = 256
                          + path = "tls.key"
                        }
                    }
                }
            }
        }

      + traffic {
          + latest_revision = (known after apply)
          + percent         = (known after apply)
          + revision_name   = (known after apply)
        }
    }

  # module.vault-deploy.google_cloud_run_service_iam_policy.noauth will be created
  + resource "google_cloud_run_service_iam_policy" "noauth" {
      + etag        = (known after apply)
      + id          = (known after apply)
      + location    = "us-central1"
      + policy_data = jsonencode(
            {
              + bindings = [
                  + {
                      + members = [
                          + "allUsers",
                        ]
                      + role    = "roles/run.invoker"
                    },
                ]
            }
        )
      + project     = (known after apply)
      + service     = "vault"
    }

  # module.vault-deploy.google_kms_crypto_key.vault will be created
  + resource "google_kms_crypto_key" "vault" {
      + destroy_scheduled_duration = (known after apply)
      + id                         = (known after apply)
      + import_only                = (known after apply)
      + key_ring                   = "projects/jtcressy-net-235001/locations/global/keyRings/vault-production"
      + name                       = "vault-key"
      + purpose                    = "ENCRYPT_DECRYPT"
      + rotation_period            = "31536000s"

      + version_template {
          + algorithm        = (known after apply)
          + protection_level = (known after apply)
        }
    }

  # module.vault-deploy.google_kms_key_ring_iam_member.vault will be created
  + resource "google_kms_key_ring_iam_member" "vault" {
      + etag        = (known after apply)
      + id          = (known after apply)
      + key_ring_id = "projects/jtcressy-net-235001/locations/global/keyRings/vault-production"
      + member      = "serviceAccount:vault-sa@jtcressy-net-235001.iam.gserviceaccount.com"
      + role        = "roles/owner"
    }

  # module.vault-deploy.google_storage_bucket.vault will be updated in-place
  ~ resource "google_storage_bucket" "vault" {
        id                          = "vault-jtcressy-net"
      ~ labels                      = {
          - "managed-by-cnrm" = "true" -> null
        }
        name                        = "vault-jtcressy-net"
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.vault-deploy.google_storage_bucket_iam_member.vault will be created
  + resource "google_storage_bucket_iam_member" "vault" {
      + bucket = "vault-jtcressy-net"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "serviceAccount:vault-sa@jtcressy-net-235001.iam.gserviceaccount.com"
      + role   = "roles/storage.objectAdmin"
    }

Plan: 7 to add, 1 to change, 0 to destroy.

Warning: Content-Type is not recognized as a text type, got "application/x-x509-ca-cert"

  with module.vault-deploy.data.http.cforigin-ca,
  on ../../modules/vault-deploy/cloudflare.tf line 34, in data "http" "cforigin-ca":
  34: data "http" "cforigin-ca" {

If the content is binary data, Terraform may not properly handle the contents
of the response.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.


```

</details>

*Pusher: @jtcressy, Action: `pull_request`, Workflow: `Terraform`, Context: `/layers/deploy/`*
<!-- created by terraform//layers/deploy//update-pull-request -->